<!-- 商品說明 -->

<template>
  <hr>
  <div class="container">
    <!-- 按鈕群組 -->
    <div class="btn-group mt-5">
      <button v-for="(button, index) in buttons" :key="index" type="button" class="btn btn-outline-secondary" @click="changeContent(index)" :class="{ active: activeButton === index }">
        {{ button.title }}
      </button>
    </div>

    <!-- 內容區域 -->
    <div class="mt-3 mb-5">
      <div v-for="(button, index) in buttons" :key="index" v-show="activeButton === index">
        <div v-html="button.content"></div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      buttons: [
        {
          title: '付款事項',
          content:
          `尊敬的顧客您好，<br><br>
          感謝您選擇使用我們的電商平台進行購物。為了確保您的付款過程順利且安全，請詳細閱讀以下付款須知：<br><br>
          1. 付款方式：<br>
          我們提供多種便捷的付款方式，包括但不限於：<br>
          - 信用卡支付<br>
          - 轉帳支付<br>
          - 貨到付款（部分地區）<br><br>
          2. 付款安全性：<br>
          為了保障您的個人資訊安全，我們使用最先進的加密技術，確保所有付款交易均安全可靠。請您放心使用我們的付款系統進行交易。<br><br>
          3. 發票與收據：<br>
          完成付款後，您將收到包含訂單詳細資訊的電子發票或收據。如有任何需要調整的地方，請在結帳前務必仔細檢查資訊。<br><br>
          4. 付款問題與客服：<br>
          如果您在付款過程中遇到任何問題，或有其他付款相關的疑問，請隨時聯繫我們的客服團隊。我們將竭誠為您提供協助，確保您的購物體驗順利愉快。<br><br>
          感謝您對我們的支持，祝您購物愉快！`
        },
        {
          title: '配送方式',
          content: `尊敬的顧客您好，<br><br>
            感謝您選擇我們的電商平台。為了確保您的購物體驗順利，請詳細閱讀以下有關配送與運費的政策：<br><br>
            1. 配送方式：<br>
            我們提供多種便捷的配送方式，以滿足不同顧客的需求，包括但不限於：<br>
            - 快遞服務<br>
            - 郵政寄送<br><br>
            2. 配送地區：<br>
            我們將商品配送至全球多個地區，請在結帳頁面選擇正確的送貨地址以獲取相應的運費資訊。<br><br>
            3. 運費政策：<br>
            運費根據配送地區和商品重量計算，具體運費將在結帳時顯示。為了鼓勵更大額度的購物，我們可能會提供滿額免運的特殊優惠，請關注促銷活動以享受額外優惠。<br><br>
            4. 運費折扣：<br>
            在特殊促銷期間，我們可能提供運費折扣或免運費服務。請留意我們的官方網站或通訊渠道以確保您不會錯過任何優惠。<br><br>
            5. 配送時程：<br>
            預計配送時間將在結帳頁面上顯示。實際的配送時間可能因物流情況、節假日或其他不可控因素而有所變動，敬請諒解。<br><br>
            6. 聯絡我們：<br>
            如果您對配送與運費有任何疑問或特殊需求，請隨時聯繫我們的客服團隊。我們將盡力提供協助，以確保您的購物體驗順利愉快。<br><br>
            感謝您的信任與支持，祝您購物愉快！`
        },
        {
          title: '退貨須知',
          content: '尊敬的顧客您好，<br><br>' +
            '感謝您選擇我們的電商平台。為了確保您在退貨過程中有一個順暢的體驗，請詳細閱讀以下退貨須知事項：<br><br>' +
            '1. 退貨資格：<br>' +
            '請確保商品未經使用、損壞或洗滌，並保留原始包裝。 退貨商品必須在收到商品後的15天內辦理，逾期將無法受理。<br><br>' +
            '2. 申請退貨步驟：<br>' +
            '登入您的帳戶，進入訂單頁面，點擊相應訂單進入詳情頁。 選擇「申請退貨」，填寫相關資訊，並上傳清晰的商品照片。<br><br>' +
            '3. 審核流程：<br>' +
            '我們將在收到您的退貨申請後進行審核，通常在3個工作日內完成。 若退貨申請通過，我們將提供退貨地址及相關注意事項。<br><br>' +
            '4. 退款方式：<br>' +
            '退款將於商品退回後的7個工作日內處理，退款金額將以您原支付方式退回。<br><br>' +
            '5. 注意事項：<br>' +
            '請勿自行寄回商品，需等待我們的審核通過後，再按照指示辦理退貨。 退貨過程中如有任何問題，請隨時聯繫我們的客服團隊，我們將竭誠為您提供協助。<br>' +
            '我們致力於提供優質的購物體驗，並感謝您對我們的支持。如有任何疑問或建議，請隨時與我們聯絡。<br><br>' +
            '祝您購物愉快！'
        }
      ],
      activeButton: 0 // 表示當前選中的按鈕索引
    }
  },
  methods: {
    changeContent (index) {
      this.activeButton = index // 點擊按鈕時切換內容
    }
  }
}
</script>
